import React, {Component} from 'react';
import firebase from 'firebase';
import {Link} from 'react-router-dom'
import Form from './Form';

class Agreement extends Component {
    render() {
        return (
            <Form>
                <div className="row">
                    <div className="col-md-8 offset-md-2">
                        <h2>ข้อตกลง</h2>
                        <p>
                            ข้าพเจ้าผู้มีชื่อปรากฏและลงลายมือชื่ออยู่ด้านหน้าของสัญญาฉบับนี้
                            (ซึ่งต่อไปนี้จะเรียกว่า “ผู้กู้”) ขอให้คำมั่นต่อ บริษัท มันนี่ดิ จำกัด
                            (ซึ่งต่อไปนี้จะเรียกว่า “ผู้ให้กู้”) ว่า
                            ผู้กู้ตกลงยินยอมปฏิบัติตามข้อกำหนดและเงื่อนไขดังต่อไปนี้
                        </p>
                        <p>
                            1. ตามข้อกำหนดสัญญาสินเชื่อหมุนเวียนทั่วไปของผู้ให้กู้
                            สัญญาสินเชื่อหมุนเวียนทั่วไป (ต่อไปเรียกว่า “สัญญาฉบับนี้”) จะมีผลบริบูรณ์
                            เมื่อบริษัท มันนี่ดิ จำกัด (ต่อไปเรียกว่า “บริษัท”)
                            ได้อนุมัติคำขอสินเชื่อของบุคคลที่ได้ลงนาม (ต่อไปเรียกว่า “ลูกค้า”)
                            ในใบสมัครและสัญญาสินเชื่อหมุนเวียนทั่วไป (ต่อไปเรียกว่า “ใบสมัคร/หนังสือสัญญา”)
                        </p>
                        <p>
                            2.
                            บริษัทจะพิจารณาให้วงเงินสินเชื่อโดยดุลยพินิจของตนเองเมื่อบริษัทอนุมัติคำขอสินเชื่อของลูกค้า
                            บริษัทจะต้องแจ้งลูกค้าให้ทราบถึงวงเงินสินเชื่อของลูกค้าโดยแจ้งเป็นหนังสือ
                            โทรศัพท์ หรือแจ้งด้วยวิธีการอื่นใดที่บริษัทจะกำหนด
                        </p>
                        <p>
                            3. ลูกค้าจะต้องชำระเงินต้นให้แก่บริษัทตามข้อกำหนดนี้
                            ลูกค้าต้องชำระให้บริษัทตามจำนวนเงินต้น
                            ตามกำหนดวันชำระรายเดือนที่บริษัทและลูกค้าตกลงร่วมกันโดยชำระผ่านการโอนเงิน
                            ถ้ามีค่าธรรมเนียมเกิดขึ้น ลูกค้าจะเป็นผู้รับผิดชอบเอง
                        </p>
                        <p>
                            4. บริษัทจะนำเงินที่ได้รับชำระจากลูกค้าไปหักชำระหนี้ตามลำดับ ดังต่อไปนี้ (ก)
                            ค่าใช้จ่ายต่างๆ (ข) ค่าใช้จ่ายในการติดตามทวงถามหนี้ที่ค้างชำระ (ค)
                            ค่าธรรมเนียมการใช้วงเงินที่ค้างชำระ (ง) ดอกเบี้ยที่ค้างชำระ (จ)
                            ค่าใช้จ่ายในการติดตามทวงถามหนี้ (ฉ) ค่าธรรมเนียมการใช้วงเงิน (ช)ดอกเบี้ย และ (ซ)
                            เงินต้น
                        </p>
                        <p>
                            5. ลูกค้าสามารถขอชำระคืนเงินต้นคงค้างทั้งหมด หรือบางส่วน
                            ก่อนถึงวันที่กำหนดชำระเงินได้ โดยลูกค้าจะต้องชำระพร้อมกับค่าใช้จ่ายต่างๆ
                            ค่าใช้จ่ายในการติดตามทวงถามหนี้ ค่าธรรมเนียมการใช้วงเงิน และดอกเบี้ย
                            ที่เกิดขึ้นจนถึงวันที่ลูกค้าได้ชำระคืนเงินต้นดังกล่าวข้างต้น
                        </p>
                        <p>
                            6.ลูกค้ายินยอมจ่ายดอกเบี้ย ค่าธรรมเนียมในการใช้วงเงิน
                            และค่าใช้จ่ายตามที่ได้จ่ายไปจริงและพอสมควรแก่เหตุ ตามรายละเอียดดังต่อไปนี้ 1.
                            ดอกเบี้ย ค่าปรับ ค่าธรรมเนียมอื่นๆ กรณีล่าช้ากว่ากำหนด ดอกเบี้ย 15.00%
                            ค่าธรรมเนียม 13.00% 2. ค่าใช้จ่ายที่จ่ายให้แก่หน่วยงานราชการ ค่าอากรแสตมป์ "1
                            บาทต่อทุกๆวงเงินที่อนุมัติ 2,000 บาท และเศษของ 2,000 บาท" 3.
                            ค่าใช้จ่ายที่เป็นต้นทุนในการดำเนินงานของบริษัท ค่าใช้จ่ายในการติดตามทวงถามหนี้
                            "พ้นกำหนดชำระตั้งแต่วันที่ 4 เป็นต้นไป 10 บาท/วัน ( สูงสุด 100 บาท )
                            พ้นกำหนดชำระตั้งแต่ 31 วันเป็นต้นไป 100 บาท ต่อ 30 วัน" 4. หมายเหตุ :
                            ค่าใช้จ่ายที่ใช้ในการชำระเงินตามข้อ 3.1
                            หน่วยงานภายนอกนั้นๆจะเป็นผู้กำหนดและค่าธรรมเนียมดังกล่าวอาจมีการเปลี่ยนแปลงตามที่เรียกเก็บจริงโดยผู้ให้บริการรับชำระเงิน
                        </p>
                        <p>
                            7. ลูกค้าจะสูญเสียประโยชน์แห่งเงื่อนเวลาทันที
                            โดยไม่ต้องได้รับคำบอกกล่าวจากบริษัท
                            เมื่อมีเหตุการณ์ใดเหตุการณ์หนึ่งดังต่อไปนี้เกิดขึ้นแก่ลูกค้า
                            และบริษัทสามารถเรียกให้ลูกค้าชำระเงินทั้งหมดได้โดยพลัน (ก)
                            ลูกค้าถูกศาลสั่งให้เป็นบุคคลไร้ความสามารถ
                            ถูกศาลสั่งให้ทรัพย์สินของลูกค้าอยู่ภายใต้การจัดการของศาล
                            หรือศาลมีคำสั่งให้ทรัพย์สินอยู่ภายใต้การดูแลควบคุมของเจ้าพนักงานพิทักษ์ทรัพย์
                            (ข) เมื่อลูกค้าถึงแก่ความตาย (ค) เมื่อลูกค้าถูกบังคับคดี ถูกยึดหรืออายัดทรัพย์
                            หรือยอมให้ถูกยึดหรืออายัดตามกฎหมายหรือคำพิพากษา
                        </p>
                        <p>
                            8.ถ้ามีเหตุการณ์ใดเหตุการณ์หนึ่งดังต่อไปนี้เกิดขึ้นแก่ลูกค้า
                            บริษัทจะถือว่าเป็นเหตุผิดสัญญา ซึ่งบริษัทจะบอกกล่าวลูกค้าเป็นหนังสือ
                            เพื่อแก้ไขเหตุผิดสัญญา ดังกล่าวภายในระยะเวลาอันสมควร (ก)
                            เมื่อลูกค้าไม่ปฏิบัติตามเงื่อนไขแห่งสัญญาฉบับนี้ (ข)
                            เมื่อลูกค้าให้ข้อมูลอันเป็นเท็จ หรือมอบเอกสารหลักฐานใดๆที่มีข้อความอันเป็นเท็จ
                            หรือเป็นเอกสารปลอมแก่บริษัท (ค)
                            เมื่อลูกค้าไม่ชำระหนี้ทั้งหมดให้ถูกต้องครบถ้วนตามเงื่อนไขของสัญญาฉบับนี้ลูกค้าจะสูญเสียประโยชน์แห่งเงื่อนเวลาทันที
                            หากลูกค้าไม่แก้ไขเหตุแห่งการผิดสัญญาภายในเวลาที่กำหนดไว้ในคำบอกกล่าว
                            บริษัทมีสิทธิที่จะเรียกให้ลูกค้าชำระหนี้ทั้งหมด
                            ที่ยังคงค้างชำระให้แก่บริษัทได้ทันทีี
                        </p>
                        <p>
                            9.บรรดาคำบอกกล่าวที่บริษัทต้องจัดทำขึ้นเป็นหนังสือตามกฎหมายหรือข้อกำหนดนี้
                            บริษัทจะดำเนินการจัดส่งคำบอกกล่าวนั้นทางไปรษณีย์ลงทะเบียนไปยังที่อยู่ลูกค้าที่ได้ระบุในใบสมัคร/หนังสือสัญญาฉบับนี้
                            หรือที่อยู่ที่ได้มีการแจ้งครั้งหลังสุด
                            โดยให้ถือว่าเป็นการจัดส่งให้ลูกค้าโดยชอบด้วยกฎหมายและให้ถือว่าลูกค้าได้รับทราบแล้ว
                            ลูกค้าจะต้องแจ้งบริษัทถึงการเปลี่ยนแปลงที่อยู่ รายละเอียดการติดต่อ สถานที่ทำงาน
                            หรือข้อมูลอื่นใดที่เกี่ยวข้องกับลูกค้า
                            โดยจะแจ้งให้บริษัททราบถึงการเปลี่ยนแปลงทุกครั้งภายใน 7 วัน
                            นับจากวันที่ได้มีการเปลี่ยนแปลง
                            ถ้าเอกสารที่บริษัทส่งให้แก่ลูกค้านั้นไม่ถึงลูกค้า หรือ ถึงลูกค้าล่าช้า
                            เนื่องจากลูกค้าไม่แจ้งการเปลี่ยนแปลงดังกล่าวให้ถือว่าการจัดส่งดังกล่าวได้ไปถึงลูกค้า
                            ณ เวลาที่หนังสือบอกกล่าวนั้นควรไปถึง
                            ลูกค้าอาจเรียกร้องให้บริษัทเปลี่ยนแปลงวันที่ถึงกำหนดชำระหนี้ในแต่ละเดือนได้
                            เมื่อวันที่จะได้รับเงินได้ของลูกค้ามีการเปลี่ยนแปลงไป
                        </p>
                        <p>
                            10.ไม่ว่าในระหว่างที่สัญญาฉบับนี้มีผลหรือไม่
                            บริษัทอาจนำข้อมูลต่างๆของลูกค้าเปิดเผยให้แก่นิติบุคคลใดที่ประกอบธุรกิจเกี่ยวกับข้อมูลเครดิต(ต่อไปนี้เรียกว่า“บริษัทข้อมูลเครดิต”)
                            เพื่อวัตถุประสงค์ในทางกฎหมายและบริษัทข้อมูลเครดิตจะส่งต่อให้กับผู้ใช้บริการ
                            นอกจากนั้นบริษัทอาจใช้ข้อมูลของลูกค้าในการเสนอบริการ/สินค้าที่บริษัทเห็นว่าเป็นประโยชน์แก่ลูกค้า
                            ทั้งนี้ลูกค้าจะไม่เรียกร้องค่าเสียหายหรือค่าทดแทนใดๆจากบริษัทที่เกิดจากการกระทำของบริษัทข้างต้น
                        </p>
                        <p>
                            11.
                            บริษัทอาจโอนสิทธิเรียกร้องทั้งหมดหรือบางส่วนที่บริษัทมีภายใต้สัญญาฉบับนี้แก่บุคคลภายนอก
                            ในกรณีดังกล่าวนี้บริษัทจะต้องบอกกล่าวลูกค้าเป็นหนังสือไม่น้อยกว่าหนึ่งงวดของการชำระเงินกู้หรือดอกเบี้ย
                            ก่อนวันที่การโอนสิทธิเรียกร้องมีผลบังคับ
                        </p>
                        <p>
                            12. บริษัทอาจมอบหมายให้บุคคลภายนอก
                            เป็นผู้มีอำนาจดำเนินการติดตามทวงถามหนี้จากลูกค้าได้
                            และบริษัทอาจให้ข้อมูลต่างๆของลูกค้าแก่บุคคลภายนอกเพื่อวัตถุประสงค์ในการส่งเอกสารไปติดตามทวงถามชำระหนี้ได้
                        </p>
                        <p>
                            13. บริษัทอาจขอคัดสำเนาทะเบียนบ้านของลูกค้าจากหน่วยงานของรัฐ
                            เมื่อบริษัทเห็นว่ามีความจำเป็นในการใช้สิทธิเรียกร้องหรือกรณีอื่นใด
                            และบริษัทอาจติดต่อไปยังบุคคลอ้างอิงที่ปรากฏอยู่บนใบสมัคร/หนังสือสัญญาเพื่อประโยชน์ในการทวงถามหนี้ได้
                            โดยลูกค้าตกลงให้บริษัทสามารถเปิดเผยข้อมูลที่เกี่ยวข้องกับใบสมัคร/หนังสือสัญญา
                            และข้อมูลความเป็นหนี้แก่บุคคลอ้างอิงดังกล่าวได้เท่าที่จำเป็นและเพื่อให้บรรลุวัตถุประสงค์ดังกล่าว
                        </p>
                        <p>
                            14. บริษัทอาจเปลี่ยนแปลงอัตราดอกเบี้ย ค่าธรรมเนียมการใช้วงเงิน ค่าใช้จ่ายต่างๆ
                            และวิธีการคิดเงินต้น อัตราดอกเบี้ย ค่าธรรมเนียมการใช้วงเงิน และค่าใช้จ่ายต่างๆ
                            ซึ่งได้ระบุไว้ในข้อกำหนดเป็นอัตราและวิธีการตามที่บริษัทเห็นสมควร
                            การเปลี่ยนแปลงดังกล่าวให้ถือว่าเป็นส่วนหนึ่งของข้อกำหนด
                            บริษัทจะทำการแจ้งลูกค้าที่ทำให้ลูกค้าเสียประโยชน์
                            เนื่องจากการเปลี่ยนแปลงอัตราดอกเบี้ย ค่าธรรมเนียมการใช้วงเงิน และค่าใช้จ่ายต่างๆ
                            โดยการบอกกล่าวลูกค้าเป็นหนังสือไม่น้อยกว่า 30 วัน ก่อนมีการเปลี่ยนแปลง
                            อย่างไรก็ดีในกรณีเร่งด่วนบริษัทจะแจ้งการเปลี่ยนแปลงโดยการประกาศในหนังสือพิมพ์ภาษาไทยรายวันไม่น้อยกว่า
                            7
                            วันและจะส่งคำบอกกล่าวเป็นหนังสือให้แก่ลูกค้าในกรณีที่มีการเพิ่มอัตราดอกเบี้ยให้อีกครั้งหนึ่ง
                        </p>
                        <p>
                            15.ในกรณีที่บริษัทผ่อนผันการชำระหนี้หรือการปฏิบัติตามข้อกำหนดให้แก่ลูกค้า
                            ไม่ถือว่าเป็นการสละสิทธิหรือเสียสิทธิอย่างใดๆของลูกค้าภายใต้สัญญาฉบับนี้
                            ผู้กู้ได้อ่านและเข้าใจในข้อกำหนดและเงื่อนไขฉบับนี้โดยตลอดแล้วเห็นว่าถูกต้องตรงตามเจตนาและความประสงค์ของผู้กู้ทุกประการผู้กู้จึงได้ลงลายมือชื่อไว้ในสัญญาฉบับนี้เพื่อเป็นหลักฐานสำคัญ
                        </p>
                    </div>
                </div>
                <Link to="thankyou">ยอมรับข้อตกลง</Link>
            </Form>
        );
    }
};

export default Agreement