import React from 'react';

const Fifth = () => {
    return (
        <div>
            <div className="fifthContainer">
                <div className="row">
                    <div className="col-md-12 text-center">
                        <h1>"เราต้องการลดปัญหาเงินกู้นอกระบบ"</h1>
                    </div>
                </div>
                <div className="row">
                    <div className="col-md-8 text-center">
                        <p>
                            มันนี่ดิเป็นสตาร์ทอัพที่อยากแก้ปัญหาความต้องการเงินเร่งด่วนชั่วคราวของมนุษย์เงินเดือน
                            เราเชื่อว่า ทุกวันที่เราไปทำงาน เราได้เงินเดือน และถ้าจำเป็นต้องใช้
                            ควรสามารถใช้เงินก้อนนั้นได้ เราเชื่อว่า
                            ตัวเลือกในการกู้ในปัจจุบันนั้นไม่ตอบโจทย์ มีขั้นต่ำ ให้กู้นานอย่างเดียว
                            ดอกเบี้ยแพง เราไม่คิดดอกเบี้ย เพราะเชื่อว่า
                            สำหรับเงินยืมจำนวนไม่มากที่จะคืนสิ้นเดือนนั้น ดอกเบี้ยไม่ควรบังคับ
                            แล้วแต่ผู้ยืมตัดสินใจว่าจะจ่ายให้เราเท่าไรเพื่อให้เราดำเนินธุรกิจนี้ต่อไปได้
                            หรือถ้าไม่มี จะไม่ให้ก็ได้
                        </p>
                    </div>
                    <div className="col-md-4 text-center">
                        <p>Contact Us โทร: 097-117-7937 Line: MoneyDi</p>
                    </div>
                </div>
            </div>
        </div>
    )
};

export default Fifth